fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.BKM_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресВХранилище = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.BKM_ГрафикОтпусков.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтпуска(Команда)
    ПроверитьОтпускаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(, 
							"Сотрудник, ДатаНачала, ДатаОкончания"), );
	Возврат Адрес;
КонецФункции

&НаСервере
Процедура ПроверитьОтпускаНаСервере()
    ОтпускаПоСотрудникам = ПолучитьОтпускаПоСотрудникам();
    
    Для каждого Элемент Из ОтпускаПоСотрудникам Цикл
        ДанныеСотрудника = Элемент.Значение;
        
        Если ДанныеСотрудника.ВсегоДней > 28 Тогда       	
            Для каждого ДанныеСтроки Из ДанныеСотрудника.Строки Цикл
                СтрокаТЧ = ДанныеСтроки.СтрокаТЧ;
                СтрокаТЧ.ПревышениеОтпуска = Истина;
            КонецЦикла;    
        Иначе
        	Для каждого ДанныеСтроки Из ДанныеСотрудника.Строки Цикл
                СтрокаТЧ = ДанныеСтроки.СтрокаТЧ;
                СтрокаТЧ.ПревышениеОтпуска = Ложь;
            КонецЦикла;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьОтпускаПоСотрудникам()
    ТЧОтпуска = Объект.ОтпускаСотрудников;
    Результат = Новый Соответствие;
    
    Для каждого Строка Из ТЧОтпуска Цикл
        Сотрудник = Строка.Сотрудник;
        
        РазностьДней = ?(Строка.ДатаНачала <> Неопределено И Строка.ДатаОкончания <> Неопределено, 
                         (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400, 0);
        
        ДанныеСотрудника = Результат.Получить(Сотрудник);
        Если ДанныеСотрудника = Неопределено Тогда
            ДанныеСотрудника = Новый Структура("Строки, ВсегоДней");
            ДанныеСотрудника.Строки = Новый Массив;
            ДанныеСотрудника.ВсегоДней = 0;
            Результат.Вставить(Сотрудник, ДанныеСотрудника);
        КонецЕсли;
        
        ДанныеСотрудника.Строки.Добавить(Новый Структура("СтрокаТЧ, ДнейОтпуска", Строка, РазностьДней));
        ДанныеСотрудника.ВсегоДней = ДанныеСотрудника.ВсегоДней + РазностьДней;
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

#КонецОбласти
